import sys              # ─────────────────────────────────────────────────   라이브러리

print(''' '출력문' ''')
print('Hello, World\n') # ─────────────────────────────────────────────────   출력문

a = 10  # ─────────────────────────────────────────────────────────────────   변수 선언

print(''' '조건문' ''')
if (a > 5) : # ────────────────────────────────────────────────────────────   조건문
    print(a, '은(는) 5보다 크다\n')
else :
    print(a, '은(는) 5보다 작다\n')

b, c, d, e= 10, 20, 0.5, '10' # ───────────────────────────────────────────   다중 변수 선언

print(''' '연산' ''')
print(b, '+', c, '=', b + c) # ─────────┐   
print(b, '-', c, '=', b - c) #          │   
print(b, '*', c, '=', b * c) #          ├──────────────────────────────────   사칙연산(나머지)  
print(b, '/', c, '=', b / c) #          │
print(b, '%', c, '=', b % c, '\n') # ───┘   

print(b, '//', c, '=', b // c) # ───────┬──────────────────────────────────   소수점 없이 나눗셈(단, 실수와의 연산에선 실수형으로 나타냄)
print(c, '//', d, '=', c // d) # ───────┘
print(2, '**', 10, '=', 2 ** 10, '\n') # ──────────────────────────────────   거듭제곱 연산

print(''' '자료형 확인' ''')
print(type(a)) # ────────┐
print(type(d)) #         ├─────────────────────────────────────────────────   자료형 확인
print(type(e),'\n') # ───┘

t1, t2 = sys.maxsize, sys.maxsize + 1 # ───────────────────────────────────   다중 변수 선언

print(''' '자료형 범위' ''') 
print(t1) # ─────────────┐   
print(t2) #              │   
print(type(t1)) #        ├─────────────────────────────────────────────────   정수의 자료형 범위 (메모리가 허용하는 만큼)
print(type(t2)) #        │
print(t1 * t1, '\n') # ──┘  

print(''' '형변환' ''') 
print(int(2.2)) # ───────┐
print(int(2 + 0.2)) #    │
print(int('2')) #        │
print(float(2)) #        ├─────────────────────────────────────────────────   형변환
print(float(1 + 1)) #    │
print(float('2'),'\n') # ┘

i1 = i2 = i3 = None #──────────────────────────────────────────────────────   다중 변수 선언(null)

print(''' '입력' ''')
i1 = input('첫번째 값을 입력하세요 : ') # ───────────────────────────────┐
i2 = input('두번째 값을 입력하세요 : ') #                                ├───   입력
i3 = input('연산자를 선택하세요\n1 [+] 2 [-] 3 [*] 4 [/] 5 [%]\n: ') # ──┘

if (int(i3) == 1) :
    print(int(i1), '+', int(i2), '=', int(i1) + int(i2),'\n') # ───┐   
if (int(i3) == 2) :                                           #    │
    print(int(i1), '-', int(i2), '=', int(i1) - int(i2),'\n') #    │   
if (int(i3) == 3) :                                           #    │
    print(int(i1), '*', int(i2), '=', int(i1) * int(i2),'\n') #    │
if (int(i3) == 4) :                                           #    ├───────   조건문 +사칙연산(나머지)  
    print(int(i1), '/', int(i2), '=', int(i1) / int(i2),'\n') #    │
if (int(i3) == 5) :                                           #    │
    print(int(i1), '%', int(i2), '=', int(i1) % int(i2),'\n') #    │
if (int(i3) > 5) :                                            #    │
    print('프로그램을 종료합니다.\n')                           # ───┘   

print(''' '스플릿' ''')
    
in4 = in5 = in6 = None

in4, in5, in6 = input('전화번호 입력(\'-\' 로 구분) :').split('-')

print('앞자리', in4)
print('가운뎃자리', in5)
print('뒷자리', in6)
    